{"pages":[{"title":"page test","text":"","link":"/page-test/index-1.html"},{"title":"page test","text":"這是 H1 的1相關指令：chmod chown umask","link":"/page-test/index.html"}],"posts":[{"title":"真正的 home brew 測試","text":"This template explains our QA process for shipping bug-free software. brew tap homebrew/boneyard 有一個好用的指令 versions ，但現在不支援了 看到一篇文說 ，似乎把舊版的repo 都刪掉了 I read all the answers. It’s 2020 and there is no easy way or official command to do that 沒有好的 downgrade 方法 😢 第十三章、Linux 帳號管理與 ACL 權限設定","link":"/2021/09/02/%E7%9C%9F%E6%AD%A3%E7%9A%84-home-brew-%E6%B8%AC%E8%A9%A6/"},{"title":"初始教學頁面保留一下","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2021/09/02/hello-world/"},{"title":"第一篇：自我介紹與部落格方針","text":"前言大家好，我是林禹志，這是這網站的第一篇文，會簡單的描述一下我的心路歷程與創建部落格的規劃 首先我必須要說，因為我還很菜沒有什麼實務經驗，所以以下的內容會依照我目前的理解來寫，可能會有很多錯誤的部分，敬請見諒~ 第一次使用雲端 (AWS)第一次接觸到雲端是大學時系上有一位教授 (黃懷陞 教授，下稱 Cage ) 是 AWS 的合作夥伴，利用 AWS educate 的資格開了兩門選修課，我對雲端很感興趣就選了 在那時還不懂網路架構等等的東西，所以用到最多的就是 EC2 當作虛擬機使用而已，其他服務就是聽聽理論 (如： AWS S3 能夠給予幾個9的可用性等等的)，有點沒辦法融會貫通。不過我認為雲端是未來的趨勢，後來也請 Cage 作為我們專題的指導教授，繼續跟著他學習。 第一次參加社群活動 (2019 COSCUP)能夠接觸到這塊，也是 Cage 要我們去找找專題的靈感。那時候我還沒有接觸過 Linux ，甚至連 Ubuntu 也沒聽過，有點像劉姥姥進大觀園，幾乎什麼都看不懂聽不懂 XD 其中有一場議程讓我比較印象深刻，主題叫 ：「帶你了解 grep 的背後原理」，想當然，我那時也沒用過這個指令，我就給了自己一個小小的目標 「我明年的 COSCUP，至少要知道 grep 是什麼!」 現在來看，確實是一個非常小的目標，但那時候我還很習慣老師教什麼我就學什麼，還不太會自己上網學習新的東西(還待在舒適圈) 總之，開啟了一個很大的門，裡面有著無數的知識等著挖掘。 實習安排的社群大大演講收穫在一年的實習中，總算是學習到了比較完整的 Linux 操作 (Red Hat) ，不過實習的內容想要下一段再講，這邊想先講社群大大的演講。 公司邀請到了 Phil 與 Rico 兩位講師，現在發現都是在 CNTUG 的大大們呢~ Rico 主要是講如何貢獻開源專案(openstack)，但因為我現在還沒有開始貢獻，所以還沒有什麼體悟 倒是 Phil 主要是談論自學的一些經驗等等，現在比較有感 Phil 在剛開始講的時候就說 ： 「我要講的東西很困難，要像我一樣有病才有可能堅持下去」 「我不期望我講完能讓台下所有人都動起來，現在台下大概20幾個人，我只要能啟發一個人，這場演講就成功了」 我大概也不算被啟發的，畢竟也是過了快一年多才發覺到自學的重要性 「喔還有，我通常只記得女生，男生的話不要過來跟我裝熟」 演講內容其實大概是分享一下 Phil 讀研究所的一些經歷等等，還有可以去改 .vimrc 當作自學的目標啊之類的 我記最深的是，QA時我問 Phil ：「我最近在自學 D Jango (發音錯)，不知道您能不能給我一些建議？」 他就回我：「你發音錯了吧？ django?」 然後也沒回答我的問題，大概說了三次我發音錯了XD 還有我回答問題，Phil 有準備貼紙獎勵，過去一看都是沒看過的東東，就選了一個可愛的三地鼠(podman) Phil 就跟我分享一下最近他有在研究這個 pod 管理程式這樣 當時聽的似懂非懂，不過現在才知道原來 podman 基本用起來跟 docker 差不多呢 (基本) 大概是這樣 實習時，自學openstack的痛苦經歷沒錯，是痛苦的經歷，有點像是越級打怪這樣，一大堆看都看不懂的名詞，安裝文件裡面預期有的基礎知識我幾乎都沒有，所以就只能看一看，然後照著文件內的指令照做，就變成了以下的循環： 「欸，失敗了欸，怎麼會失敗呢」 (把錯誤訊息丟 google ，隨便亂改參數或.yaml檔再執行) 「欸！成功了欸！怎麼會成功呢！？」 這樣的流程大概跑了10-20次吧，搞了半年，總算是把 Red Hat openstack 的基本架構架起來了 然後，實習就結束了，現在回去看我那時候的安裝筆記，裡面就全部是我改了哪些檔案，哪個參數等等，部署的指令可能排列組合起來就有幾百種 更要命的是 ， overcloud 在部署的時候，指令跑下去有時候就要半小時 (如果參數錯在後面的步驟) 也就是我測試上百個的參數，每天就是在執行指令，然後看著黑畫面開始拜託他成功。 現在看來是一個很糟糕的自學心態，不過那時候有每個禮拜的進度壓力，再加上接學校助教每個禮拜都要備課等等的 最大的收穫大概是知道自己是有多廢吧(? ，也確立了後面激起自學的心 把那時候不懂的名詞記一下：L2,L3 ,HAproxy,Puppet,vxlan,gateway(對，就是那個gateway) , 認識 CNTUG (COSCUP 2021)今年因為疫情的關係，COSCUP 改為線上舉辦，改使用 Gather town 進行議程，每一個議程軌也改成講師預先錄好影片後再播放 我就和前兩年參與的模式一樣，先規劃一下有興趣的主題，再來看看要看什麼，注意到了大部分我有興趣的主題都是 CNTUG 的議程軌 其中 Gene Guo 大大的 「從零打造自己的 Home Lab」 主題很吸引我，因為正有打算來自建一個 Home Lab 來練習 openstack 用 (他的 lab 也是有用 openstack 架構) 不過內容還是有很多聽不懂的部分，我也盡可能的做成筆記囉 最重要的是，受惠於線上舉辦，我也總算鼓起勇氣在虛擬會場上找到了 Gene Guo 大大聊聊。 主要就提到了前面 openstack 的慘痛學習經驗，他也給了我一些關鍵字(OVS,OVN)等，也建議我可以一個一個元件來裝 (RHEL 的就是一次全包) ，再來慢慢了解。 日後的學習方針與部落格規劃上面就大概講了一下會走到現在這步(? 的情況 在前面這段時間(2021/7-9) ，把 Cisco CCNA 證照的內容讀了一下，總算是對網路架構有了比較完整的了解，也把 Red Hat 的 RHCSA 證照拿到手了，接下來會繼續往 docker,k8s,openstack(ovs,ovn) 等等學習，也因為我還很多東西不會，所以希望能提供給跟我一樣的人一些啟發，一起學習進步這樣 目前大概會參考 phil 的 home lab ，也來搞一個自己的文章或是先寫政府課的心得(SRE 課程，要上到11/30)，內容有包含 k8s 與 container 等，或許有什麼新的體悟也可以來更新文章 大概就是這樣，也期許自己能夠繼續堅持下去囉 感謝你對我有興趣把這篇落落長的第一篇文章看完~~~ 後記最近和一位在企業管伺服器的講師聊到 openstack ，結果他一聽到回我三個字「爛東西」 實在是一個很令人意外的答案XD” ，不過我應該還是會用用看才能知道「爛」在哪邊吧","link":"/2021/09/19/%E7%AC%AC%E4%B8%80%E7%AF%87%EF%BC%9A%E8%87%AA%E6%88%91%E4%BB%8B%E7%B4%B9%E8%88%87%E9%83%A8%E8%90%BD%E6%A0%BC%E6%96%B9%E9%87%9D/"}],"tags":[],"categories":[]}